MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
// sys_init_lpc17xx.c

#include <stdint.h>
#include "boardconfig.h"
#include "lpcmcu.h"
#include "sys_init.h"


// power-down unused devices
// starts up the PLL
// sets up GPIO pins
// sets up ADC & DAC pins
// wait for PLL to lock.
// connect to PLL clock
// setup & enable the MAM
// set interrupt vectors mapping

#ifndef BIT
    #define BIT(n) (1UL << (n))
#endif // BIT



#define __FIRCOSC 4000000    // LPC17xx

// SYSPLL FCCO limits
#define __FCCOMIN 275000000
#define __FCCOMAX 550000000

#ifndef CCLK
    #error CCLK is not defined
#endif

#if (CCLK < 1000000) || (CCLK > 120000000)
    #error CCLK is out of range (1MHz - 120MHz)
#endif

#define __OSCRANGE_Val (0x00)

#ifdef FOSC
    #if (FOSC < 1000000) || (FOSC > 25000000)
        #error FOSC out of range (1MHz - 25MHz)
    #endif
    #define __SYSPLLCLKIN (FOSC)
    #if (FOSC > 20000000)
        #undef __OSCRANGE_Val
        #define __OSCRANGE_Val (0x10)
    #endif
#else
    #define __SYSPLLCLKIN (__FIRCOSC)
#endif // FOSC


// select FLASH CONFIG register
#if CCLK <= 20000000
    #define __FLASHCFG_Val (0x3a | (0 << 12))
#elif CCLK <= 40000000
    #define __FLASHCFG_Val (0x3a | (1 << 12))
#elif CCLK <= 60000000
    #define __FLASHCFG_Val (0x3a | (2 << 12))
#elif CCLK <= 80000000
    #define __FLASHCFG_Val (0x3a | (3 << 12))
#elif CCLK <= 100000000
    #define __FLASHCFG_Val (0x3a | (4 << 12))
#else
    #if (defined(LPC1759) || defined(LPC1769)) && (CCLK <= 120000000)
        #define __FLASHCFG_Val (0x3a | (4 << 12))
    #else
        #define __FLASHCFG_Val (0x3a | (5 << 12))
    #endif
#endif


// select PLL clock source: main-OSC, RTC-OSC or IRC-OSC
#if defined(FOSC)
    #define __CLKSRCSEL_Val 1 // main OSC
#else
    #define __CLKSRCSEL_Val 0 // IRC OSC
#endif // FOSC

//#if (((CCLK / __SYSPLLCLKIN) * __SYSPLLCLKIN) != CCLK)
//    #error Invalid CCLK value. Should be n * FOSC or n * IRCOSC
//#endif


#if ((__SYSPLLCLKIN) != (CCLK))
    #define __PLL_ENABLE
    #if (__SYSPLLCLKIN < 10000000) || (__SYSPLLCLKIN > 25000000)
        #error FOSC out of range (10MHz - 25MHz)
    #endif

    #if defined(M) && defined(N) && defined(CLKDIV)
        /*
         FCCO = 2 * M * FOSC / N
         CCLK = FCCO / CLKDIV
         PCLK = CCLK / PCLKDIV

         275MHz <= FCCO <= 550MHz
         10MHz <= FOSC <= 25MHz
         1 <= N <= 32
         6 <= M <= 512
         1 <= CLKDIV <= 256
         PCLKDIV = (1, 2, 4, 8)

         For FOSC = 12MHz, CCLK = 100MHz we have:
         FCCO = 300MHz, M = 25, N = 3, CLKDIV = 3

         MSEL = M - 1
         NSEL = N - 1
        */
        #define __MSEL (M - 1)
        #define __NSEL (N - 1)
        #define __CLKDIV (CLKDIV)
    #else
        #include "sys_init_lpc17xx__.h"
    #endif

    #define __PLL0CFG_Val ((__MSEL) | (__NSEL) << 16)
    #define __CCLKCFG_Val (__CLKDIV - 1)
#endif


// Set up peripheral clock
#if ! defined(PCLK)
    #define PCLK CCLK
#endif

//#if (((CCLK / PCLK) * PCLK) != CCLK)
#if (((CCLK / PCLK) != 1) && ((CCLK / PCLK) != 2) && ((CCLK / PCLK) != 4) && ((CCLK / PCLK) != 8))
    #error PCLK out of range! (CCLK / 1, 2, 4, 8)
#endif

/*
Peripheral Clocks
PWM1_CLK
I2C0_CLK
I2C1_CLK
I2C2_CLK
I2S_CLK
SPI_CLK
SSP0_CLK
SSP1_CLK
DAC_CLK
ADC_CLK
CAN1_CLK
CAN2_CLK
ACF_CLK
QEI_CLK
GPIO_CLK
PCB_CLK
TIMER0_CLK
TIMER1_CLK
TIMER2_CLK
TIMER3_CLK
UART0_CLK
UART1_CLK
UART2_CLK
UART3_CLK
RIT_CLK
SYSCON_CLK
MC_CLK
WDT_CLK

*/


#if ! defined(WDT_CLK)
    #define WDT_CLK PCLK
#endif
#define WDT_CLK_DIV (CCLK / WDT_CLK)
#if (WDT_CLK_DIV == 1)
    #define WDT_CLK_DIV_SEL 1
#elif (WDT_CLK_DIV == 2)
    #define WDT_CLK_DIV_SEL 2
#elif (WDT_CLK_DIV == 4)
    #define WDT_CLK_DIV_SEL 0
#elif (WDT_CLK_DIV == 8)
    #define WDT_CLK_DIV_SEL 3
#else
    #error WDT_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif


#if ! defined(TIMER0_CLK)
    #define TIMER0_CLK PCLK
#endif
#define TIMER0_CLK_DIV (CCLK / TIMER0_CLK)
#if (TIMER0_CLK_DIV == 1)
    #define TIMER0_CLK_DIV_SEL 1
#elif (TIMER0_CLK_DIV == 2)
    #define TIMER0_CLK_DIV_SEL 2
#elif (TIMER0_CLK_DIV == 4)
    #define TIMER0_CLK_DIV_SEL 0
#elif (TIMER0_CLK_DIV == 8)
    #define TIMER0_CLK_DIV_SEL 3
#else
    #error TIMER0_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(TIMER1_CLK)
    #define TIMER1_CLK PCLK
#endif
#define TIMER1_CLK_DIV (CCLK / TIMER1_CLK)
#if (TIMER1_CLK_DIV == 1)
    #define TIMER1_CLK_DIV_SEL 1
#elif (TIMER1_CLK_DIV == 2)
    #define TIMER1_CLK_DIV_SEL 2
#elif (TIMER1_CLK_DIV == 4)
    #define TIMER1_CLK_DIV_SEL 0
#elif (TIMER1_CLK_DIV == 8)
    #define TIMER1_CLK_DIV_SEL 3
#else
    #error TIMER1_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(UART0_CLK)
    #define UART0_CLK PCLK
#endif
#define UART0_CLK_DIV (CCLK / UART0_CLK)
#if (UART0_CLK_DIV == 1)
    #define UART0_CLK_DIV_SEL 1
#elif (UART0_CLK_DIV == 2)
    #define UART0_CLK_DIV_SEL 2
#elif (UART0_CLK_DIV == 4)
    #define UART0_CLK_DIV_SEL 0
#elif (UART0_CLK_DIV == 8)
    #define UART0_CLK_DIV_SEL 3
#else
    #error UART0_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(UART1_CLK)
    #define UART1_CLK PCLK
#endif
#define UART1_CLK_DIV (CCLK / UART1_CLK)
#if (UART1_CLK_DIV == 1)
    #define UART1_CLK_DIV_SEL 1
#elif (UART1_CLK_DIV == 2)
    #define UART1_CLK_DIV_SEL 2
#elif (UART1_CLK_DIV == 4)
    #define UART1_CLK_DIV_SEL 0
#elif (UART1_CLK_DIV == 8)
    #define UART1_CLK_DIV_SEL 3
#else
    #error UART1_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(PWM1_CLK)
    #define PWM1_CLK PCLK
#endif
#define PWM1_CLK_DIV (CCLK / PWM1_CLK)
#if (PWM1_CLK_DIV == 1)
    #define PWM1_CLK_DIV_SEL 1
#elif (PWM1_CLK_DIV == 2)
    #define PWM1_CLK_DIV_SEL 2
#elif (PWM1_CLK_DIV == 4)
    #define PWM1_CLK_DIV_SEL 0
#elif (PWM1_CLK_DIV == 8)
    #define PWM1_CLK_DIV_SEL 3
#else
    #error PWM1_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(I2C0_CLK)
    #define I2C0_CLK PCLK
#endif
#define I2C0_CLK_DIV (CCLK / I2C0_CLK)
#if (I2C0_CLK_DIV == 1)
    #define I2C0_CLK_DIV_SEL 1
#elif (I2C0_CLK_DIV == 2)
    #define I2C0_CLK_DIV_SEL 2
#elif (I2C0_CLK_DIV == 4)
    #define I2C0_CLK_DIV_SEL 0
#elif (I2C0_CLK_DIV == 8)
    #define I2C0_CLK_DIV_SEL 3
#else
    #error I2C0_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

