MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
#if ! defined(SPI_CLK)
    #define SPI_CLK PCLK
#endif
#define SPI_CLK_DIV (CCLK / SPI_CLK)
#if (SPI_CLK_DIV == 1)
    #define SPI_CLK_DIV_SEL 1
#elif (SPI_CLK_DIV == 2)
    #define SPI_CLK_DIV_SEL 2
#elif (SPI_CLK_DIV == 4)
    #define SPI_CLK_DIV_SEL 0
#elif (SPI_CLK_DIV == 8)
    #define SPI_CLK_DIV_SEL 3
#else
    #error SPI_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(SSP1_CLK)
    #define SSP1_CLK PCLK
#endif
#define SSP1_CLK_DIV (CCLK / SSP1_CLK)
#if (SSP1_CLK_DIV == 1)
    #define SSP1_CLK_DIV_SEL 1
#elif (SSP1_CLK_DIV == 2)
    #define SSP1_CLK_DIV_SEL 2
#elif (SSP1_CLK_DIV == 4)
    #define SSP1_CLK_DIV_SEL 0
#elif (SSP1_CLK_DIV == 8)
    #define SSP1_CLK_DIV_SEL 3
#else
    #error SSP1_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(DAC_CLK)
    #define DAC_CLK PCLK
#endif
#define DAC_CLK_DIV (CCLK / DAC_CLK)
#if (DAC_CLK_DIV == 1)
    #define DAC_CLK_DIV_SEL 1
#elif (DAC_CLK_DIV == 2)
    #define DAC_CLK_DIV_SEL 2
#elif (DAC_CLK_DIV == 4)
    #define DAC_CLK_DIV_SEL 0
#elif (DAC_CLK_DIV == 8)
    #define DAC_CLK_DIV_SEL 3
#else
    #error DAC_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(ADC_CLK)
    #define ADC_CLK PCLK
#endif
#define ADC_CLK_DIV (CCLK / ADC_CLK)
#if (ADC_CLK_DIV == 1)
    #define ADC_CLK_DIV_SEL 1
#elif (ADC_CLK_DIV == 2)
    #define ADC_CLK_DIV_SEL 2
#elif (ADC_CLK_DIV == 4)
    #define ADC_CLK_DIV_SEL 0
#elif (ADC_CLK_DIV == 8)
    #define ADC_CLK_DIV_SEL 3
#else
    #error ADC_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(CAN1_CLK)
    #define CAN1_CLK PCLK
#endif
#define CAN1_CLK_DIV (CCLK / CAN1_CLK)
#if (CAN1_CLK_DIV == 1)
    #define CAN1_CLK_DIV_SEL 1
#elif (CAN1_CLK_DIV == 2)
    #define CAN1_CLK_DIV_SEL 2
#elif (CAN1_CLK_DIV == 4)
    #define CAN1_CLK_DIV_SEL 0
#elif (CAN1_CLK_DIV == 6)
    #define CAN1_CLK_DIV_SEL 3
#else
    #error CAN1_CLK out of range! (CCLK / 1, 2, 4, 6)
#endif

#if ! defined(CAN2_CLK)
    #define CAN2_CLK PCLK
#endif
#define CAN2_CLK_DIV (CCLK / CAN2_CLK)
#if (CAN2_CLK_DIV == 1)
    #define CAN2_CLK_DIV_SEL 1
#elif (CAN2_CLK_DIV == 2)
    #define CAN2_CLK_DIV_SEL 2
#elif (CAN2_CLK_DIV == 4)
    #define CAN2_CLK_DIV_SEL 0
#elif (CAN2_CLK_DIV == 6)
    #define CAN2_CLK_DIV_SEL 3
#else
    #error CAN2_CLK out of range! (CCLK / 1, 2, 4, 6)
#endif

#if ! defined(ACF_CLK)
    #define ACF_CLK PCLK
#endif
#define ACF_CLK_DIV (CCLK / ACF_CLK)
#if (ACF_CLK_DIV == 1)
    #define ACF_CLK_DIV_SEL 1
#elif (ACF_CLK_DIV == 2)
    #define ACF_CLK_DIV_SEL 2
#elif (ACF_CLK_DIV == 4)
    #define ACF_CLK_DIV_SEL 0
#elif (ACF_CLK_DIV == 6)
    #define ACF_CLK_DIV_SEL 3
#else
    #error ACF_CLK out of range! (CCLK / 1, 2, 4, 6)
#endif

#if ! defined(QEI_CLK)
    #define QEI_CLK PCLK
#endif
#define QEI_CLK_DIV (CCLK / QEI_CLK)
#if (QEI_CLK_DIV == 1)
    #define QEI_CLK_DIV_SEL 1
#elif (QEI_CLK_DIV == 2)
    #define QEI_CLK_DIV_SEL 2
#elif (QEI_CLK_DIV == 4)
    #define QEI_CLK_DIV_SEL 0
#elif (QEI_CLK_DIV == 8)
    #define QEI_CLK_DIV_SEL 3
#else
    #error QEI_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(GPIO_CLK)
    #define GPIO_CLK PCLK
#endif
#define GPIO_CLK_DIV (CCLK / GPIO_CLK)
#if (GPIO_CLK_DIV == 1)
    #define GPIO_CLK_DIV_SEL 1
#elif (GPIO_CLK_DIV == 2)
    #define GPIO_CLK_DIV_SEL 2
#elif (GPIO_CLK_DIV == 4)
    #define GPIO_CLK_DIV_SEL 0
#elif (GPIO_CLK_DIV == 8)
    #define GPIO_CLK_DIV_SEL 3
#else
    #error GPIO_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(PCB_CLK)
    #define PCB_CLK PCLK
#endif
#define PCB_CLK_DIV (CCLK / PCB_CLK)
#if (PCB_CLK_DIV == 1)
    #define PCB_CLK_DIV_SEL 1
#elif (PCB_CLK_DIV == 2)
    #define PCB_CLK_DIV_SEL 2
#elif (PCB_CLK_DIV == 4)
    #define PCB_CLK_DIV_SEL 0
#elif (PCB_CLK_DIV == 8)
    #define PCB_CLK_DIV_SEL 3
#else
    #error PCB_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(I2C1_CLK)
    #define I2C1_CLK PCLK
#endif
#define I2C1_CLK_DIV (CCLK / I2C1_CLK)
#if (I2C1_CLK_DIV == 1)
    #define I2C1_CLK_DIV_SEL 1
#elif (I2C1_CLK_DIV == 2)
    #define I2C1_CLK_DIV_SEL 2
#elif (I2C1_CLK_DIV == 4)
    #define I2C1_CLK_DIV_SEL 0
#elif (I2C1_CLK_DIV == 8)
    #define I2C1_CLK_DIV_SEL 3
#else
    #error I2C1_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(SSP0_CLK)
    #define SSP0_CLK PCLK
#endif
#define SSP0_CLK_DIV (CCLK / SSP0_CLK)
#if (SSP0_CLK_DIV == 1)
    #define SSP0_CLK_DIV_SEL 1
#elif (SSP0_CLK_DIV == 2)
    #define SSP0_CLK_DIV_SEL 2
#elif (SSP0_CLK_DIV == 4)
    #define SSP0_CLK_DIV_SEL 0
#elif (SSP0_CLK_DIV == 8)
    #define SSP0_CLK_DIV_SEL 3
#else
    #error SSP0_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(TIMER2_CLK)
    #define TIMER2_CLK PCLK
#endif
#define TIMER2_CLK_DIV (CCLK / TIMER2_CLK)
#if (TIMER2_CLK_DIV == 1)
    #define TIMER2_CLK_DIV_SEL 1
#elif (TIMER2_CLK_DIV == 2)
    #define TIMER2_CLK_DIV_SEL 2
#elif (TIMER2_CLK_DIV == 4)
    #define TIMER2_CLK_DIV_SEL 0
#elif (TIMER2_CLK_DIV == 8)
    #define TIMER2_CLK_DIV_SEL 3
#else
    #error TIMER2_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(TIMER3_CLK)
    #define TIMER3_CLK PCLK
#endif
#define TIMER3_CLK_DIV (CCLK / TIMER3_CLK)
#if (TIMER3_CLK_DIV == 1)
    #define TIMER3_CLK_DIV_SEL 1
#elif (TIMER3_CLK_DIV == 2)
    #define TIMER3_CLK_DIV_SEL 2
#elif (TIMER3_CLK_DIV == 4)
    #define TIMER3_CLK_DIV_SEL 0
#elif (TIMER3_CLK_DIV == 8)
    #define TIMER3_CLK_DIV_SEL 3
#else
    #error TIMER3_CLK out of range! (CCLUART2K / 1, 2, 4, 8)
#endif

#if ! defined(UART2_CLK)
    #define UART2_CLK PCLK
#endif
#define UART2_CLK_DIV (CCLK / UART2_CLK)
#if (UART2_CLK_DIV == 1)
    #define UART2_CLK_DIV_SEL 1
#elif (UART2_CLK_DIV == 2)
    #define UART2_CLK_DIV_SEL 2
#elif (UART2_CLK_DIV == 4)
    #define UART2_CLK_DIV_SEL 0
#elif (UART2_CLK_DIV == 8)
    #define UART2_CLK_DIV_SEL 3
#else
    #error UART2_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(UART3_CLK)
    #define UART3_CLK PCLK
#endif
#define UART3_CLK_DIV (CCLK / UART3_CLK)
#if (UART3_CLK_DIV == 1)
    #define UART3_CLK_DIV_SEL 1
#elif (UART3_CLK_DIV == 2)
    #define UART3_CLK_DIV_SEL 2
#elif (UART3_CLK_DIV == 4)
    #define UART3_CLK_DIV_SEL 0
#elif (UART3_CLK_DIV == 8)
    #define UART3_CLK_DIV_SEL 3
#else
    #error UART3_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

