MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
#if ! defined(I2C2_CLK)
    #define I2C2_CLK PCLK
#endif
#define I2C2_CLK_DIV (CCLK / I2C2_CLK)
#if (I2C2_CLK_DIV == 1)
    #define I2C2_CLK_DIV_SEL 1
#elif (I2C2_CLK_DIV == 2)
    #define I2C2_CLK_DIV_SEL 2
#elif (I2C2_CLK_DIV == 4)
    #define I2C2_CLK_DIV_SEL 0
#elif (I2C2_CLK_DIV == 8)
    #define I2C2_CLK_DIV_SEL 3
#else
    #error I2C2_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(I2S_CLK)
    #define I2S_CLK PCLK
#endif
#define I2S_CLK_DIV (CCLK / I2S_CLK)
#if (I2S_CLK_DIV == 1)
    #define I2S_CLK_DIV_SEL 1
#elif (I2S_CLK_DIV == 2)
    #define I2S_CLK_DIV_SEL 2
#elif (I2S_CLK_DIV == 4)
    #define I2S_CLK_DIV_SEL 0
#elif (I2S_CLK_DIV == 8)
    #define I2S_CLK_DIV_SEL 3
#else
    #error I2S_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(RIT_CLK)
    #define RIT_CLK PCLK
#endif
#define RIT_CLK_DIV (CCLK / RIT_CLK)
#if (RIT_CLK_DIV == 1)
    #define RIT_CLK_DIV_SEL 1
#elif (RIT_CLK_DIV == 2)
    #define RIT_CLK_DIV_SEL 2
#elif (RIT_CLK_DIV == 4)
    #define RIT_CLK_DIV_SEL 0
#elif (RIT_CLK_DIV == 8)
    #define RIT_CLK_DIV_SEL 3
#else
    #error RIT_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(SYSCON_CLK)
    #define SYSCON_CLK PCLK
#endif
#define SYSCON_CLK_DIV (CCLK / SYSCON_CLK)
#if (SYSCON_CLK_DIV == 1)
    #define SYSCON_CLK_DIV_SEL 1
#elif (SYSCON_CLK_DIV == 2)
    #define SYSCON_CLK_DIV_SEL 2
#elif (SYSCON_CLK_DIV == 4)
    #define SYSCON_CLK_DIV_SEL 0
#elif (SYSCON_CLK_DIV == 8)
    #define SYSCON_CLK_DIV_SEL 3
#else
    #error SYSCON_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if ! defined(MC_CLK)
    #define MC_CLK PCLK
#endif
#define MC_CLK_DIV (CCLK / MC_CLK)
#if (MC_CLK_DIV == 1)
    #define MC_CLK_DIV_SEL 1
#elif (MC_CLK_DIV == 2)
    #define MC_CLK_DIV_SEL 2
#elif (MC_CLK_DIV == 4)
    #define MC_CLK_DIV_SEL 0
#elif (MC_CLK_DIV == 8)
    #define MC_CLK_DIV_SEL 3
#else
    #error MC_CLK out of range! (CCLK / 1, 2, 4, 8)
#endif

#if (CAN1_CLK_DIV_SEL != CAN2_CLK_DIV_SEL) || (CAN1_CLK_DIV_SEL != ACF_CLK_DIV_SEL)
    #error CAN1, CAN2 and ACF must have the same PCLK divide value when the CAN function is used
#endif

#define __PCLKSEL0_Val ((WDT_CLK_DIV_SEL << 0) | (TIMER0_CLK_DIV_SEL << 2) | \
    (TIMER1_CLK_DIV_SEL << 4) | (UART0_CLK_DIV_SEL << 6) | (UART1_CLK_DIV_SEL << 8) | \
    (PWM1_CLK_DIV_SEL << 12) | (I2C0_CLK_DIV_SEL << 14) | (SPI_CLK_DIV_SEL << 16) | \
    (SSP1_CLK_DIV_SEL << 20) | (DAC_CLK_DIV_SEL << 22) | (ADC_CLK_DIV_SEL << 24) | \
    (CAN1_CLK_DIV_SEL << 26) | (CAN2_CLK_DIV_SEL << 28) | (ACF_CLK_DIV_SEL << 30))

#define __PCLKSEL1_Val ((QEI_CLK_DIV_SEL << 0) | (GPIO_CLK_DIV_SEL << 2) | \
    (PCB_CLK_DIV_SEL << 4) | (I2C1_CLK_DIV_SEL << 6) | (SSP0_CLK_DIV_SEL << 10) | \
    (TIMER2_CLK_DIV_SEL << 12) | (TIMER3_CLK_DIV_SEL << 14) | (UART2_CLK_DIV_SEL << 16) | \
    (UART3_CLK_DIV_SEL << 18) | (I2C2_CLK_DIV_SEL << 20) | (I2S_CLK_DIV_SEL << 22) | \
    (RIT_CLK_DIV_SEL << 26) | (SYSCON_CLK_DIV_SEL << 28) | (MC_CLK_DIV_SEL << 30))


// disable all peripherals, power on just GPIO
#define __PCONP_Val PCONP_GPIO

// PINMODE register values
#define PULL_DOWN   (3)
#define PULL_UP     (0)
#define REPEATER    (1)
#define NORMAL_IO   (2)
#define CLRMASK     (~3)

// somewhere in board config files must be defined
// PIOx_PULLUP_BITS
// PIOx_PULLDOWN_BITS
// PIOx_REPEATER_BITS
// PIOx_OPENDRAIN_BITS
// PIOx_ADC_BITS
// PIOx_DAC_BITS
// PIOx_OUTPUT_BITS

// some of these settings are mutually exclusive
#if (PIO0_PULLUP_BITS & PIO0_PULLDOWN_BITS) | (PIO0_PULLUP_BITS & PIO0_REPEATER_BITS) | (PIO0_REPEATER_BITS & PIO0_PULLDOWN_BITS)
	#error "Bad pin configuration for port 0"
#endif

#if (PIO1_PULLUP_BITS & PIO1_PULLDOWN_BITS) | (PIO1_PULLUP_BITS & PIO1_REPEATER_BITS) | (PIO1_REPEATER_BITS & PIO1_PULLDOWN_BITS)
	#error "Bad pin configuration for port 1"
#endif

#if (PIO2_PULLUP_BITS & PIO2_PULLDOWN_BITS) | (PIO2_PULLUP_BITS & PIO2_REPEATER_BITS) | (PIO2_REPEATER_BITS & PIO2_PULLDOWN_BITS)
	#error "Bad pin configuration for port 2"
#endif

#if (PIO3_PULLUP_BITS & PIO3_PULLDOWN_BITS) | (PIO3_PULLUP_BITS & PIO3_REPEATER_BITS) | (PIO3_REPEATER_BITS & PIO3_PULLDOWN_BITS)
	#error "Bad pin configuration for port 3"
#endif

#if (PIO4_PULLUP_BITS & PIO4_PULLDOWN_BITS) | (PIO4_PULLUP_BITS & PIO4_REPEATER_BITS) | (PIO4_REPEATER_BITS & PIO4_PULLDOWN_BITS)
	#error "Bad pin configuration for port 4"
#endif

// all special IO options and all ADC/DAC IO options are mutually exclusive
#if ((PIO0_PULLUP_BITS | PIO0_PULLDOWN_BITS | PIO0_REPEATER_BITS) & (PIO0_ADC_BITS | PIO0_DAC_BITS))
	#error "Bad pin configuration for port 0"
#endif

#if ((PIO1_PULLUP_BITS | PIO1_PULLDOWN_BITS | PIO1_REPEATER_BITS) & (PIO1_ADC_BITS | PIO1_DAC_BITS))
	#error "Bad pin configuration for port 1"
#endif

#if ((PIO2_PULLUP_BITS | PIO2_PULLDOWN_BITS | PIO2_REPEATER_BITS) & (PIO2_ADC_BITS | PIO2_DAC_BITS))
	#error "Bad pin configuration for port 2"
#endif

#if ((PIO3_PULLUP_BITS | PIO3_PULLDOWN_BITS | PIO3_REPEATER_BITS) & (PIO3_ADC_BITS | PIO3_DAC_BITS))
	#error "Bad pin configuration for port 3"
#endif

#if ((PIO4_PULLUP_BITS | PIO4_PULLDOWN_BITS | PIO4_REPEATER_BITS) & (PIO4_ADC_BITS | PIO4_DAC_BITS))
	#error "Bad pin configuration for port 4"
#endif


// configure pin mode
#if (PIO0_PULLUP_BITS & BIT(0))
	#define __PINMODE0_0 (PULL_UP << 0)
#elif (PIO0_PULLDOWN_BITS & BIT(0))
	#define __PINMODE0_0 (PULL_DOWN << 0)
#elif (PIO0_REPEATER_BITS & BIT(0))
	#define __PINMODE0_0 (REPEATER << 0)
#else
	#define __PINMODE0_0 (NORMAL_IO << 0)
#endif

#if (PIO0_PULLUP_BITS & BIT(1))
	#define __PINMODE0_2 (PULL_UP << 2)
#elif (PIO0_PULLDOWN_BITS & BIT(1))
	#define __PINMODE0_2 (PULL_DOWN << 2)
#elif (PIO0_REPEATER_BITS & BIT(1))
	#define __PINMODE0_2 (REPEATER << 2)
#else
	#define __PINMODE0_2 (NORMAL_IO << 2)
#endif

#if (PIO0_PULLUP_BITS & BIT(2))
	#define __PINMODE0_4 (PULL_UP << 4)
#elif (PIO0_PULLDOWN_BITS & BIT(2))
	#define __PINMODE0_4 (PULL_DOWN << 4)
#elif (PIO0_REPEATER_BITS & BIT(2))
	#define __PINMODE0_4 (REPEATER << 4)
#else
	#define __PINMODE0_4 (NORMAL_IO << 4)
#endif

#if (PIO0_PULLUP_BITS & BIT(3))
	#define __PINMODE0_6 (PULL_UP << 6)
#elif (PIO0_PULLDOWN_BITS & BIT(3))
	#define __PINMODE0_6 (PULL_DOWN << 6)
#elif (PIO0_REPEATER_BITS & BIT(3))
	#define __PINMODE0_6 (REPEATER << 6)
#else
	#define __PINMODE0_6 (NORMAL_IO << 6)
#endif

#if defined(LPC176x)
    #if (PIO0_PULLUP_BITS &     BIT(4))
        #define __PINMODE0_8 (PULL_UP <<   8)
    #elif (PIO0_PULLDOWN_BITS & BIT(4))
        #define __PINMODE0_8 (PULL_DOWN << 8)
    #elif (PIO0_REPEATER_BITS & BIT(4))
        #define __PINMODE0_8 (REPEATER <<  8)
    #else
        #define __PINMODE0_8 (NORMAL_IO << 8)
    #endif

