MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
    #if (PIO0_PULLUP_BITS &     BIT(5))
        #define __PINMODE0_10 (PULL_UP <<   10)
    #elif (PIO0_PULLDOWN_BITS & BIT(5))
        #define __PINMODE0_10 (PULL_DOWN << 10)
    #elif (PIO0_REPEATER_BITS & BIT(5))
        #define __PINMODE0_10 (REPEATER <<  10)
    #else
        #define __PINMODE0_10 (NORMAL_IO << 10)
    #endif
#else
	#define __PINMODE0_8  0
	#define __PINMODE0_10 0
#endif // defined(LPC176x)

#if (PIO0_PULLUP_BITS &     BIT(6))
	#define __PINMODE0_12 (PULL_UP <<   12)
#elif (PIO0_PULLDOWN_BITS & BIT(6))
	#define __PINMODE0_12 (PULL_DOWN << 12)
#elif (PIO0_REPEATER_BITS & BIT(6))
	#define __PINMODE0_12 (REPEATER <<  12)
#else
	#define __PINMODE0_12 (NORMAL_IO << 12)
#endif

#if (PIO0_PULLUP_BITS &     BIT(7))
	#define __PINMODE0_14 (PULL_UP <<   14)
#elif (PIO0_PULLDOWN_BITS & BIT(7))
	#define __PINMODE0_14 (PULL_DOWN << 14)
#elif (PIO0_REPEATER_BITS & BIT(7))
	#define __PINMODE0_14 (REPEATER <<  14)
#else
	#define __PINMODE0_14 (NORMAL_IO << 14)
#endif


#if (PIO0_PULLUP_BITS &     BIT(8))
	#define __PINMODE0_16 (PULL_UP <<   16)
#elif (PIO0_PULLDOWN_BITS & BIT(8))
	#define __PINMODE0_16 (PULL_DOWN << 16)
#elif (PIO0_REPEATER_BITS & BIT(8))
	#define __PINMODE0_16 (REPEATER <<  16)
#else
	#define __PINMODE0_16 (NORMAL_IO << 16)
#endif

#if (PIO0_PULLUP_BITS &     BIT(9))
	#define __PINMODE0_18 (PULL_UP <<   18)
#elif (PIO0_PULLDOWN_BITS & BIT(9))
	#define __PINMODE0_18 (PULL_DOWN << 18)
#elif (PIO0_REPEATER_BITS & BIT(9))
	#define __PINMODE0_18 (REPEATER <<  18)
#else
	#define __PINMODE0_18 (NORMAL_IO << 18)
#endif

#if (PIO0_PULLUP_BITS &     BIT(10))
	#define __PINMODE0_20 (PULL_UP <<   20)
#elif (PIO0_PULLDOWN_BITS & BIT(10))
	#define __PINMODE0_20 (PULL_DOWN << 20)
#elif (PIO0_REPEATER_BITS & BIT(10))
	#define __PINMODE0_20 (REPEATER <<  20)
#else
	#define __PINMODE0_20 (NORMAL_IO << 20)
#endif

#if (PIO0_PULLUP_BITS &     BIT(11))
	#define __PINMODE0_22 (PULL_UP <<   22)
#elif (PIO0_PULLDOWN_BITS & BIT(11))
	#define __PINMODE0_22 (PULL_DOWN << 22)
#elif (PIO0_REPEATER_BITS & BIT(11))
	#define __PINMODE0_22 (REPEATER <<  22)
#else
	#define __PINMODE0_22 (NORMAL_IO << 22)
#endif


#if (PIO0_PULLUP_BITS &     BIT(15))
	#define __PINMODE0_30 (PULL_UP <<   30)
#elif (PIO0_PULLDOWN_BITS & BIT(15))
	#define __PINMODE0_30 (PULL_DOWN << 30)
#elif (PIO0_REPEATER_BITS & BIT(15))
	#define __PINMODE0_30 (REPEATER <<  30)
#else
	#define __PINMODE0_30 (NORMAL_IO << 30)
#endif




#if (PIO0_PULLUP_BITS &     BIT(16))
	#define __PINMODE1_0 (PULL_UP <<   0)
#elif (PIO0_PULLDOWN_BITS & BIT(16))
	#define __PINMODE1_0 (PULL_DOWN << 0)
#elif (PIO0_REPEATER_BITS & BIT(16))
	#define __PINMODE1_0 (REPEATER <<  0)
#else
	#define __PINMODE1_0 (NORMAL_IO << 0)
#endif

#if (PIO0_PULLUP_BITS &     BIT(17))
	#define __PINMODE1_2 (PULL_UP <<   2)
#elif (PIO0_PULLDOWN_BITS & BIT(17))
	#define __PINMODE1_2 (PULL_DOWN << 2)
#elif (PIO0_REPEATER_BITS & BIT(17))
	#define __PINMODE1_2 (REPEATER <<  2)
#else
	#define __PINMODE1_2 (NORMAL_IO << 2)
#endif

#if (PIO0_PULLUP_BITS &     BIT(18))
	#define __PINMODE1_4 (PULL_UP <<   4)
#elif (PIO0_PULLDOWN_BITS & BIT(18))
	#define __PINMODE1_4 (PULL_DOWN << 4)
#elif (PIO0_REPEATER_BITS & BIT(18))
	#define __PINMODE1_4 (REPEATER <<  4)
#else
	#define __PINMODE1_4 (NORMAL_IO << 4)
#endif

#if defined(LPC176x)
    #if (PIO0_PULLUP_BITS &     BIT(19))
        #define __PINMODE1_6 (PULL_UP <<   6)
    #elif (PIO0_PULLDOWN_BITS & BIT(19))
        #define __PINMODE1_6 (PULL_DOWN << 6)
    #elif (PIO0_REPEATER_BITS & BIT(19))
        #define __PINMODE1_6 (REPEATER <<  6)
    #else
        #define __PINMODE1_6 (NORMAL_IO << 6)
    #endif

    #if (PIO0_PULLUP_BITS &     BIT(20))
        #define __PINMODE1_8 (PULL_UP <<   8)
    #elif (PIO0_PULLDOWN_BITS & BIT(20))
        #define __PINMODE1_8 (PULL_DOWN << 8)
    #elif (PIO0_REPEATER_BITS & BIT(20))
        #define __PINMODE1_8 (REPEATER <<  8)
    #else
        #define __PINMODE1_8 (NORMAL_IO << 8)
    #endif

    #if (PIO0_PULLUP_BITS &     BIT(21))
        #define __PINMODE1_10 (PULL_UP <<   10)
    #elif (PIO0_PULLDOWN_BITS & BIT(21))
        #define __PINMODE1_10 (PULL_DOWN << 10)
    #elif (PIO0_REPEATER_BITS & BIT(21))
        #define __PINMODE1_10 (REPEATER <<  10)
    #else
        #define __PINMODE1_10 (NORMAL_IO << 10)
    #endif
#else
	#define __PINMODE1_6  0
	#define __PINMODE1_8  0
	#define __PINMODE1_10 0
#endif // defined(LPC176x)

#if (PIO0_PULLUP_BITS &     BIT(22))
	#define __PINMODE1_12 (PULL_UP <<   12)
#elif (PIO0_PULLDOWN_BITS & BIT(22))
	#define __PINMODE1_12 (PULL_DOWN << 12)
#elif (PIO0_REPEATER_BITS & BIT(22))
	#define __PINMODE1_12 (REPEATER <<  12)
#else
	#define __PINMODE1_12 (NORMAL_IO << 12)
#endif

#if defined(LPC176x)
    #if (PIO0_PULLUP_BITS &     BIT(23))
        #define __PINMODE1_14 (PULL_UP <<   14)
    #elif (PIO0_PULLDOWN_BITS & BIT(23))
        #define __PINMODE1_14 (PULL_DOWN << 14)
    #elif (PIO0_REPEATER_BITS & BIT(23))
        #define __PINMODE1_14 (REPEATER <<  14)
    #else
        #define __PINMODE1_14 (NORMAL_IO << 14)
    #endif

    #if (PIO0_PULLUP_BITS &     BIT(24))
        #define __PINMODE1_16 (PULL_UP <<   16)
    #elif (PIO0_PULLDOWN_BITS & BIT(24))
        #define __PINMODE1_16 (PULL_DOWN << 16)
    #elif (PIO0_REPEATER_BITS & BIT(24))
        #define __PINMODE1_16 (REPEATER <<  16)
    #else
        #define __PINMODE1_16 (NORMAL_IO << 16)
    #endif
#else
	#define __PINMODE1_14 0
	#define __PINMODE1_16 0
#endif // defined(LPC176x)


#if (PIO0_PULLUP_BITS &     BIT(25))
	#define __PINMODE1_18 (PULL_UP <<   18)
#elif (PIO0_PULLDOWN_BITS & BIT(25))
	#define __PINMODE1_18 (PULL_DOWN << 18)
#elif (PIO0_REPEATER_BITS & BIT(25))
	#define __PINMODE1_18 (REPEATER <<  18)
#else
	#define __PINMODE1_18 (NORMAL_IO << 18)
#endif

#if (PIO0_PULLUP_BITS &     BIT(26))
	#define __PINMODE1_20 (PULL_UP <<   20)
#elif (PIO0_PULLDOWN_BITS & BIT(26))
	#define __PINMODE1_20 (PULL_DOWN << 20)
#elif (PIO0_REPEATER_BITS & BIT(26))
	#define __PINMODE1_20 (REPEATER <<  20)
#else
	#define __PINMODE1_20 (NORMAL_IO << 20)
#endif



// PIO1

#if (PIO1_PULLUP_BITS &     BIT(0))
	#define __PINMODE2_0 (PULL_UP <<   0)
#elif (PIO1_PULLDOWN_BITS & BIT(0))
	#define __PINMODE2_0 (PULL_DOWN << 0)
#elif (PIO1_REPEATER_BITS & BIT(0))
	#define __PINMODE2_0 (REPEATER <<  0)
#else
	#define __PINMODE2_0 (NORMAL_IO << 0)
#endif

#if (PIO1_PULLUP_BITS &     BIT(1))
	#define __PINMODE2_2 (PULL_UP <<   2)
#elif (PIO1_PULLDOWN_BITS & BIT(1))
	#define __PINMODE2_2 (PULL_DOWN << 2)
#elif (PIO1_REPEATER_BITS & BIT(1))
	#define __PINMODE2_2 (REPEATER <<  2)
#else
	#define __PINMODE2_2 (NORMAL_IO << 2)
#endif

#if (PIO1_PULLUP_BITS &     BIT(4))
	#define __PINMODE2_8 (PULL_UP <<   8)
#elif (PIO1_PULLDOWN_BITS & BIT(4))
	#define __PINMODE2_8 (PULL_DOWN << 8)
#elif (PIO1_REPEATER_BITS & BIT(4))
	#define __PINMODE2_8 (REPEATER <<  8)
#else
	#define __PINMODE2_8 (NORMAL_IO << 8)
#endif

#if (PIO1_PULLUP_BITS &     BIT(8))
	#define __PINMODE2_16 (PULL_UP <<   16)
#elif (PIO1_PULLDOWN_BITS & BIT(8))
	#define __PINMODE2_16 (PULL_DOWN << 16)
#elif (PIO1_REPEATER_BITS & BIT(8))
	#define __PINMODE2_16 (REPEATER <<  16)
#else
	#define __PINMODE2_16 (NORMAL_IO << 16)
#endif

#if (PIO1_PULLUP_BITS &     BIT(9))
	#define __PINMODE2_18 (PULL_UP <<   18)
#elif (PIO1_PULLDOWN_BITS & BIT(9))
	#define __PINMODE2_18 (PULL_DOWN << 18)
#elif (PIO1_REPEATER_BITS & BIT(9))
	#define __PINMODE2_18 (REPEATER <<  18)
#else
	#define __PINMODE2_18 (NORMAL_IO << 18)
#endif

#if (PIO1_PULLUP_BITS &     BIT(10))
	#define __PINMODE2_20 (PULL_UP <<   20)
#elif (PIO1_PULLDOWN_BITS & BIT(10))
	#define __PINMODE2_20 (PULL_DOWN << 20)
#elif (PIO1_REPEATER_BITS & BIT(10))
	#define __PINMODE2_20 (REPEATER <<  20)
#else
	#define __PINMODE2_20 (NORMAL_IO << 20)
#endif

#if (PIO1_PULLUP_BITS &     BIT(14))
	#define __PINMODE2_28 (PULL_UP <<   28)
#elif (PIO1_PULLDOWN_BITS & BIT(14))
	#define __PINMODE2_28 (PULL_DOWN << 28)
#elif (PIO1_REPEATER_BITS & BIT(14))
	#define __PINMODE2_28 (REPEATER <<  28)
#else
	#define __PINMODE2_28 (NORMAL_IO << 28)
#endif

