MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
#if (PIO1_PULLUP_BITS &     BIT(15))
	#define __PINMODE2_30 (PULL_UP <<   30)
#elif (PIO1_PULLDOWN_BITS & BIT(15))
	#define __PINMODE2_30 (PULL_DOWN << 30)
#elif (PIO1_REPEATER_BITS & BIT(15))
	#define __PINMODE2_30 (REPEATER <<  30)
#else
	#define __PINMODE2_30 (NORMAL_IO << 30)
#endif



#if defined(LPC176x)
    #if (PIO1_PULLUP_BITS &     BIT(16))
        #define __PINMODE3_0 (PULL_UP <<   0)
    #elif (PIO1_PULLDOWN_BITS & BIT(16))
        #define __PINMODE3_0 (PULL_DOWN << 0)
    #elif (PIO1_REPEATER_BITS & BIT(16))
        #define __PINMODE3_0 (REPEATER <<  0)
    #else
        #define __PINMODE3_0 (NORMAL_IO << 0)
    #endif

    #if (PIO1_PULLUP_BITS &     BIT(17))
        #define __PINMODE3_2 (PULL_UP <<   2)
    #elif (PIO1_PULLDOWN_BITS & BIT(17))
        #define __PINMODE3_2 (PULL_DOWN << 2)
    #elif (PIO1_REPEATER_BITS & BIT(17))
        #define __PINMODE3_2 (REPEATER <<  2)
    #else
        #define __PINMODE3_2 (NORMAL_IO << 2)
    #endif
#else
	#define __PINMODE3_0 0
	#define __PINMODE3_2 0
#endif // defined(LPC176x)

#if (PIO1_PULLUP_BITS &     BIT(18))
	#define __PINMODE3_4 (PULL_UP <<   4)
#elif (PIO1_PULLDOWN_BITS & BIT(18))
	#define __PINMODE3_4 (PULL_DOWN << 4)
#elif (PIO1_REPEATER_BITS & BIT(18))
	#define __PINMODE3_4 (REPEATER <<  4)
#else
	#define __PINMODE3_4 (NORMAL_IO << 4)
#endif

#if (PIO1_PULLUP_BITS &     BIT(19))
	#define __PINMODE3_6 (PULL_UP <<   6)
#elif (PIO1_PULLDOWN_BITS & BIT(19))
	#define __PINMODE3_6 (PULL_DOWN << 6)
#elif (PIO1_REPEATER_BITS & BIT(19))
	#define __PINMODE3_6 (REPEATER <<  6)
#else
	#define __PINMODE3_6 (NORMAL_IO << 6)
#endif

#if (PIO1_PULLUP_BITS &     BIT(20))
	#define __PINMODE3_8 (PULL_UP <<   8)
#elif (PIO1_PULLDOWN_BITS & BIT(20))
	#define __PINMODE3_8 (PULL_DOWN << 8)
#elif (PIO1_REPEATER_BITS & BIT(20))
	#define __PINMODE3_8 (REPEATER <<  8)
#else
	#define __PINMODE3_8 (NORMAL_IO << 8)
#endif

#if defined(LPC176x)
    #if (PIO1_PULLUP_BITS &     BIT(21))
        #define __PINMODE3_10 (PULL_UP <<   10)
    #elif (PIO1_PULLDOWN_BITS & BIT(21))
        #define __PINMODE3_10 (PULL_DOWN << 10)
    #elif (PIO1_REPEATER_BITS & BIT(21))
        #define __PINMODE3_10 (REPEATER <<  10)
    #else
        #define __PINMODE3_10 (NORMAL_IO << 10)
    #endif
#else
	#define __PINMODE3_10 0
#endif // defined(LPC176x)

#if (PIO1_PULLUP_BITS &     BIT(22))
	#define __PINMODE3_12 (PULL_UP <<   12)
#elif (PIO1_PULLDOWN_BITS & BIT(22))
	#define __PINMODE3_12 (PULL_DOWN << 12)
#elif (PIO1_REPEATER_BITS & BIT(22))
	#define __PINMODE3_12 (REPEATER <<  12)
#else
	#define __PINMODE3_12 (NORMAL_IO << 12)
#endif

#if (PIO1_PULLUP_BITS &     BIT(23))
	#define __PINMODE3_14 (PULL_UP <<   14)
#elif (PIO1_PULLDOWN_BITS & BIT(23))
	#define __PINMODE3_14 (PULL_DOWN << 14)
#elif (PIO1_REPEATER_BITS & BIT(23))
	#define __PINMODE3_14 (REPEATER <<  14)
#else
	#define __PINMODE3_14 (NORMAL_IO << 14)
#endif

#if (PIO1_PULLUP_BITS &     BIT(24))
	#define __PINMODE3_16 (PULL_UP <<   16)
#elif (PIO1_PULLDOWN_BITS & BIT(24))
	#define __PINMODE3_16 (PULL_DOWN << 16)
#elif (PIO1_REPEATER_BITS & BIT(24))
	#define __PINMODE3_16 (REPEATER <<  16)
#else
	#define __PINMODE3_16 (NORMAL_IO << 16)
#endif

#if (PIO1_PULLUP_BITS &     BIT(25))
	#define __PINMODE3_18 (PULL_UP <<   18)
#elif (PIO1_PULLDOWN_BITS & BIT(25))
	#define __PINMODE3_18 (PULL_DOWN << 18)
#elif (PIO1_REPEATER_BITS & BIT(25))
	#define __PINMODE3_18 (REPEATER <<  18)
#else
	#define __PINMODE3_18 (NORMAL_IO << 18)
#endif

#if (PIO1_PULLUP_BITS &     BIT(26))
	#define __PINMODE3_20 (PULL_UP <<   20)
#elif (PIO1_PULLDOWN_BITS & BIT(26))
	#define __PINMODE3_20 (PULL_DOWN << 20)
#elif (PIO1_REPEATER_BITS & BIT(26))
	#define __PINMODE3_20 (REPEATER <<  20)
#else
	#define __PINMODE3_20 (NORMAL_IO << 20)
#endif

#if defined(LPC176x)
    #if (PIO1_PULLUP_BITS &     BIT(27))
        #define __PINMODE3_22 (PULL_UP <<   22)
    #elif (PIO1_PULLDOWN_BITS & BIT(27))
        #define __PINMODE3_22 (PULL_DOWN << 22)
    #elif (PIO1_REPEATER_BITS & BIT(27))
        #define __PINMODE3_22 (REPEATER <<  22)
    #else
        #define __PINMODE3_22 (NORMAL_IO << 22)
    #endif
#else
	#define __PINMODE3_22 0
#endif // defined(LPC176x)

#if (PIO1_PULLUP_BITS &     BIT(28))
	#define __PINMODE3_24 (PULL_UP <<   24)
#elif (PIO1_PULLDOWN_BITS & BIT(28))
	#define __PINMODE3_24 (PULL_DOWN << 24)
#elif (PIO1_REPEATER_BITS & BIT(28))
	#define __PINMODE3_24 (REPEATER <<  24)
#else
	#define __PINMODE3_24 (NORMAL_IO << 24)
#endif

#if (PIO1_PULLUP_BITS &     BIT(29))
	#define __PINMODE3_26 (PULL_UP <<   26)
#elif (PIO1_PULLDOWN_BITS & BIT(29))
	#define __PINMODE3_26 (PULL_DOWN << 26)
#elif (PIO1_REPEATER_BITS & BIT(29))
	#define __PINMODE3_26 (REPEATER <<  26)
#else
	#define __PINMODE3_26 (NORMAL_IO << 26)
#endif

#if (PIO1_PULLUP_BITS &     BIT(30))
	#define __PINMODE3_28 (PULL_UP <<   28)
#elif (PIO1_PULLDOWN_BITS & BIT(30))
	#define __PINMODE3_28 (PULL_DOWN << 28)
#elif (PIO1_REPEATER_BITS & BIT(30))
	#define __PINMODE3_28 (REPEATER <<  28)
#else
	#define __PINMODE3_28 (NORMAL_IO << 28)
#endif

#if (PIO1_PULLUP_BITS &     BIT(31))
	#define __PINMODE3_30 (PULL_UP <<   30)
#elif (PIO1_PULLDOWN_BITS & BIT(31))
	#define __PINMODE3_30 (PULL_DOWN << 30)
#elif (PIO1_REPEATER_BITS & BIT(31))
	#define __PINMODE3_30 (REPEATER <<  30)
#else
	#define __PINMODE3_30 (NORMAL_IO << 30)
#endif



// PIO2

#if (PIO2_PULLUP_BITS &     BIT(0))
	#define __PINMODE4_0 (PULL_UP <<   0)
#elif (PIO2_PULLDOWN_BITS & BIT(0))
	#define __PINMODE4_0 (PULL_DOWN << 0)
#elif (PIO2_REPEATER_BITS & BIT(0))
	#define __PINMODE4_0 (REPEATER <<  0)
#else
	#define __PINMODE4_0 (NORMAL_IO << 0)
#endif

#if (PIO2_PULLUP_BITS &     BIT(1))
	#define __PINMODE4_2 (PULL_UP <<   2)
#elif (PIO2_PULLDOWN_BITS & BIT(1))
	#define __PINMODE4_2 (PULL_DOWN << 2)
#elif (PIO2_REPEATER_BITS & BIT(1))
	#define __PINMODE4_2 (REPEATER <<  2)
#else
	#define __PINMODE4_2 (NORMAL_IO << 2)
#endif

#if (PIO2_PULLUP_BITS &     BIT(2))
	#define __PINMODE4_4 (PULL_UP <<   4)
#elif (PIO2_PULLDOWN_BITS & BIT(2))
	#define __PINMODE4_4 (PULL_DOWN << 4)
#elif (PIO2_REPEATER_BITS & BIT(2))
	#define __PINMODE4_4 (REPEATER <<  4)
#else
	#define __PINMODE4_4 (NORMAL_IO << 4)
#endif

