MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
#if (PIO2_PULLUP_BITS &     BIT(3))
	#define __PINMODE4_6 (PULL_UP <<   6)
#elif (PIO2_PULLDOWN_BITS & BIT(3))
	#define __PINMODE4_6 (PULL_DOWN << 6)
#elif (PIO2_REPEATER_BITS & BIT(3))
	#define __PINMODE4_6 (REPEATER <<  6)
#else
	#define __PINMODE4_6 (NORMAL_IO << 6)
#endif

#if (PIO2_PULLUP_BITS &     BIT(4))
	#define __PINMODE4_8 (PULL_UP <<   8)
#elif (PIO2_PULLDOWN_BITS & BIT(4))
	#define __PINMODE4_8 (PULL_DOWN << 8)
#elif (PIO2_REPEATER_BITS & BIT(4))
	#define __PINMODE4_8 (REPEATER <<  8)
#else
	#define __PINMODE4_8 (NORMAL_IO << 8)
#endif

#if (PIO2_PULLUP_BITS &     BIT(5))
	#define __PINMODE4_10 (PULL_UP <<   10)
#elif (PIO2_PULLDOWN_BITS & BIT(5))
	#define __PINMODE4_10 (PULL_DOWN << 10)
#elif (PIO2_REPEATER_BITS & BIT(5))
	#define __PINMODE4_10 (REPEATER <<  10)
#else
	#define __PINMODE4_10 (NORMAL_IO << 10)
#endif

#if (PIO2_PULLUP_BITS &     BIT(6))
	#define __PINMODE4_12 (PULL_UP <<   12)
#elif (PIO2_PULLDOWN_BITS & BIT(6))
	#define __PINMODE4_12 (PULL_DOWN << 12)
#elif (PIO2_REPEATER_BITS & BIT(6))
	#define __PINMODE4_12 (REPEATER <<  12)
#else
	#define __PINMODE4_12 (NORMAL_IO << 12)
#endif

#if (PIO2_PULLUP_BITS &     BIT(7))
	#define __PINMODE4_14 (PULL_UP <<   14)
#elif (PIO2_PULLDOWN_BITS & BIT(7))
	#define __PINMODE4_14 (PULL_DOWN << 14)
#elif (PIO2_REPEATER_BITS & BIT(7))
	#define __PINMODE4_14 (REPEATER <<  14)
#else
	#define __PINMODE4_14 (NORMAL_IO << 14)
#endif

#if (PIO2_PULLUP_BITS &     BIT(8))
	#define __PINMODE4_16 (PULL_UP <<   16)
#elif (PIO2_PULLDOWN_BITS & BIT(8))
	#define __PINMODE4_16 (PULL_DOWN << 16)
#elif (PIO2_REPEATER_BITS & BIT(8))
	#define __PINMODE4_16 (REPEATER <<  16)
#else
	#define __PINMODE4_16 (NORMAL_IO << 16)
#endif

#if (PIO2_PULLUP_BITS &     BIT(9))
	#define __PINMODE4_18 (PULL_UP <<   18)
#elif (PIO2_PULLDOWN_BITS & BIT(9))
	#define __PINMODE4_18 (PULL_DOWN << 18)
#elif (PIO2_REPEATER_BITS & BIT(9))
	#define __PINMODE4_18 (REPEATER <<  18)
#else
	#define __PINMODE4_18 (NORMAL_IO << 18)
#endif

#if (PIO2_PULLUP_BITS &     BIT(10))
	#define __PINMODE4_20 (PULL_UP <<   20)
#elif (PIO2_PULLDOWN_BITS & BIT(10))
	#define __PINMODE4_20 (PULL_DOWN << 20)
#elif (PIO2_REPEATER_BITS & BIT(10))
	#define __PINMODE4_20 (REPEATER <<  20)
#else
	#define __PINMODE4_20 (NORMAL_IO << 20)
#endif

#if defined(LPC176x)
    #if (PIO2_PULLUP_BITS &     BIT(11))
        #define __PINMODE4_22 (PULL_UP <<   22)
    #elif (PIO2_PULLDOWN_BITS & BIT(11))
        #define __PINMODE4_22 (PULL_DOWN << 22)
    #elif (PIO2_REPEATER_BITS & BIT(11))
        #define __PINMODE4_22 (REPEATER <<  22)
    #else
        #define __PINMODE4_22 (NORMAL_IO << 22)
    #endif

    #if (PIO2_PULLUP_BITS &     BIT(12))
        #define __PINMODE4_24 (PULL_UP <<   24)
    #elif (PIO2_PULLDOWN_BITS & BIT(12))
        #define __PINMODE4_24 (PULL_DOWN << 24)
    #elif (PIO2_REPEATER_BITS & BIT(12))
        #define __PINMODE4_24 (REPEATER <<  24)
    #else
        #define __PINMODE4_24 (NORMAL_IO << 24)
    #endif

    #if (PIO2_PULLUP_BITS &     BIT(13))
        #define __PINMODE4_26 (PULL_UP <<   26)
    #elif (PIO2_PULLDOWN_BITS & BIT(13))
        #define __PINMODE4_26 (PULL_DOWN << 26)
    #elif (PIO2_REPEATER_BITS & BIT(13))
        #define __PINMODE4_26 (REPEATER <<  26)
    #else
        #define __PINMODE4_26 (NORMAL_IO << 26)
    #endif
#else
	#define __PINMODE4_22 0
	#define __PINMODE4_24 0
	#define __PINMODE4_26 0
#endif // defined(LPC176x)


// PIO3

#if defined(LPC176x)
    #if (PIO3_PULLUP_BITS &     BIT(25))
        #define __PINMODE7_18 (PULL_UP <<   18)
    #elif (PIO3_PULLDOWN_BITS & BIT(25))
        #define __PINMODE7_18 (PULL_DOWN << 18)
    #elif (PIO3_REPEATER_BITS & BIT(25))
        #define __PINMODE7_18 (REPEATER <<  18)
    #else
        #define __PINMODE7_18 (NORMAL_IO << 18)
    #endif

    #if (PIO3_PULLUP_BITS &     BIT(26))
        #define __PINMODE7_20 (PULL_UP <<   20)
    #elif (PIO3_PULLDOWN_BITS & BIT(26))
        #define __PINMODE7_20 (PULL_DOWN << 20)
    #elif (PIO3_REPEATER_BITS & BIT(26))
        #define __PINMODE7_20 (REPEATER <<  20)
    #else
        #define __PINMODE7_20 (NORMAL_IO << 20)
    #endif
#else
	#define __PINMODE7_18 0
	#define __PINMODE7_20 0
#endif // defined(LPC176x)


// PIO4

#if (PIO4_PULLUP_BITS &     BIT(28))
	#define __PINMODE9_24 (PULL_UP <<   24)
#elif (PIO4_PULLDOWN_BITS & BIT(28))
	#define __PINMODE9_24 (PULL_DOWN << 24)
#elif (PIO4_REPEATER_BITS & BIT(28))
	#define __PINMODE9_24 (REPEATER <<  24)
#else
	#define __PINMODE9_24 (NORMAL_IO << 24)
#endif

#if (PIO4_PULLUP_BITS &     BIT(29))
	#define __PINMODE9_26 (PULL_UP <<   26)
#elif (PIO4_PULLDOWN_BITS & BIT(29))
	#define __PINMODE9_26 (PULL_DOWN << 26)
#elif (PIO4_REPEATER_BITS & BIT(29))
	#define __PINMODE9_26 (REPEATER <<  26)
#else
	#define __PINMODE9_26 (NORMAL_IO << 26)
#endif



#define __PINMODE0_val (__PINMODE0_0 | __PINMODE0_2 | __PINMODE0_4 | __PINMODE0_6 | \
__PINMODE0_8 | __PINMODE0_10 | __PINMODE0_12 | __PINMODE0_14 | __PINMODE0_16 | __PINMODE0_18 | \
__PINMODE0_20 | __PINMODE0_22 | __PINMODE0_30)

#define __PINMODE1_val (__PINMODE1_0 | __PINMODE1_2 | __PINMODE1_4 | __PINMODE1_6 | \
__PINMODE1_8 | __PINMODE1_10 | __PINMODE1_12 | __PINMODE1_14 | __PINMODE1_16 | __PINMODE1_18 | \
__PINMODE1_20)

#define __PINMODE2_val (__PINMODE2_0 | __PINMODE2_2 | \
__PINMODE2_8 | __PINMODE2_16 | __PINMODE2_18 | \
__PINMODE2_20 | __PINMODE2_28 | __PINMODE2_30)

#define __PINMODE3_val (__PINMODE3_0 | __PINMODE3_2 | __PINMODE3_4 | __PINMODE3_6 | \
__PINMODE3_8 | __PINMODE3_10 | __PINMODE3_12 | __PINMODE3_14 | __PINMODE3_16 | __PINMODE3_18 | \
__PINMODE3_20 | __PINMODE3_22 | __PINMODE3_24 | __PINMODE3_26 | __PINMODE3_28 | __PINMODE3_30)

#define __PINMODE4_val (__PINMODE4_0 | __PINMODE4_2 | __PINMODE4_4 | __PINMODE4_6 | \
__PINMODE4_8 | __PINMODE4_10 | __PINMODE4_12 | __PINMODE4_14 | __PINMODE4_16 | __PINMODE4_18 | \
__PINMODE4_20 | __PINMODE4_22 | __PINMODE4_24 | __PINMODE4_26)

#define __PINMODE7_val (__PINMODE7_18 | __PINMODE7_20)
#define __PINMODE9_val (__PINMODE9_24 | __PINMODE9_26)



