MarioIvancic/KIM-Kernel/LPC1769/sys_init_lpc17xx.c
#if (PIO0_ADC_BITS & BIT(2))    // AD0.7
	#define __PINSEL0_4  (2 << 4) // function 2 is AD0.7
#else
    #define __PINSEL0_4 0
#endif
#if (PIO0_ADC_BITS & BIT(3))    // AD0.6
	#define __PINSEL0_6  (2 << 6) // function 2 is AD0.6
#else
    #define __PINSEL0_6 0
#endif
#if (PIO0_ADC_BITS & BIT(23))   // AD0.0
	#define __PINSEL1_14  (1 << 14) // function 1 is AD0.0
#else
    #define __PINSEL1_14 0
#endif
#if (PIO0_ADC_BITS & BIT(24))   // AD0.1
	#define __PINSEL1_16  (1 << 16) // function 1 is AD0.1
#else
    #define __PINSEL1_16 0
#endif
#if (PIO0_ADC_BITS & BIT(25))   // AD0.2
	#define __PINSEL1_18  (1 << 18) // function 1 is AD0.2
#else
    #define __PINSEL1_18 0
#endif
#if (PIO0_ADC_BITS & BIT(26))   // AD0.3
	#define __PINSEL1_20  (1 << 20) // function 1 is AD0.3
#else
    #define __PINSEL1_20 0
#endif

#if (PIO1_ADC_BITS & BIT(30))   // AD0.4
	#define __PINSEL3_28  (3 << 28) // function 3 is AD0.4
#else
    #define __PINSEL3_28 0
#endif
#if (PIO1_ADC_BITS & BIT(31))   // AD0.5
	#define __PINSEL3_30  (3 << 30) // function 3 is AD0.5
#else
    #define __PINSEL3_30 0
#endif



#define __PINSEL0_val (__PINSEL0_4 | __PINSEL0_6)

#define __PINSEL1_val (__PINSEL1_14 | __PINSEL1_16 | __PINSEL1_18 | __PINSEL1_20)

#define __PINSEL2_val 0

#define __PINSEL3_val (__PINSEL3_28 | __PINSEL3_30)

#define __PINSEL4_val 0
#define __PINSEL7_val 0
#define __PINSEL9_val 0



void sys_init(void)
{
#ifdef FOSC
    LPC_SC->SCS = (1 << 5) | __OSCRANGE_Val;        /* Power-up System Osc and set OSCRANGE  */
    while ((LPC_SC->SCS & (1<<6)) == 0);            /* Wait for Oscillator to be ready    */
#endif // FOSC

    LPC_SC->CCLKCFG   = __CCLKCFG_Val;      /* Setup Clock Divider                */
    LPC_SC->CLKSRCSEL = __CLKSRCSEL_Val;    /* Select Clock Source for PLL0       */

    /* Periphral clock must be selected before PLL0 enabling and connecting
     * - according errata.lpc1768-16.March.2010 -
     */
    LPC_SC->PCLKSEL0  = __PCLKSEL0_Val;     /* Peripheral Clock Selection         */
    LPC_SC->PCLKSEL1  = __PCLKSEL1_Val;

    PCONP     = __PCONP_Val;                /* Power Control for Peripherals      */

#ifdef __PLL_ENABLE
    LPC_SC->PLL0CFG   = __PLL0CFG_Val;      /* configure PLL0                     */
    LPC_SC->PLL0FEED  = 0xAA;
    LPC_SC->PLL0FEED  = 0x55;

    LPC_SC->PLL0CON   = 0x01;               /* PLL0 Enable                        */
    LPC_SC->PLL0FEED  = 0xAA;
    LPC_SC->PLL0FEED  = 0x55;
    while (!(LPC_SC->PLL0STAT & (1<<26)));  /* Wait for PLOCK0                    */

    LPC_SC->PLL0CON   = 0x03;               /* PLL0 Enable & Connect              */
    LPC_SC->PLL0FEED  = 0xAA;
    LPC_SC->PLL0FEED  = 0x55;
    while (!(LPC_SC->PLL0STAT & ((1<<25) | (1<<24))));/* Wait for PLLC0_STAT & PLLE0_STAT */
#endif // __PLL_ENABLE

    LPC_SC->FLASHCFG  = __FLASHCFG_Val;

//  Set Vector table offset value
#if (__RAM_MODE__==1)
    SCB->VTOR  = 0x10000000 & 0x3FFFFF80;
#else   // FLASH mode
    SCB->VTOR  = 0x00000000 & 0x3FFFFF80;
#endif

    // setup the parallel port pin
	LPC_GPIO0->FIOPIN = PIO0_ONE_BITS;                 // set the ONEs output
	LPC_GPIO1->FIOPIN = PIO1_ONE_BITS;                 // set the ONEs output
	LPC_GPIO2->FIOPIN = PIO2_ONE_BITS;                 // set the ONEs output
	LPC_GPIO3->FIOPIN = PIO3_ONE_BITS;                 // set the ONEs output
	LPC_GPIO4->FIOPIN = PIO4_ONE_BITS;                 // set the ONEs output

	LPC_GPIO0->FIODIR = PIO0_OUTPUT_BITS;              // set the output bit direction
	LPC_GPIO1->FIODIR = PIO1_OUTPUT_BITS;              // set the output bit direction
	LPC_GPIO2->FIODIR = PIO2_OUTPUT_BITS;              // set the output bit direction
	LPC_GPIO3->FIODIR = PIO3_OUTPUT_BITS;              // set the output bit direction
	LPC_GPIO4->FIODIR = PIO4_OUTPUT_BITS;              // set the output bit direction


	// set all inputs with pull-up
	// set all outpus and ADC pins without pull-up
	PINMODE0 = __PINMODE0_val;
	PINMODE1 = __PINMODE1_val;
	PINMODE2 = __PINMODE2_val;
	PINMODE3 = __PINMODE3_val;
	PINMODE4 = __PINMODE4_val;
	PINMODE7 = __PINMODE7_val;
	PINMODE9 = __PINMODE9_val;

	PINMODE_OD0 = PIO0_OPENDRAIN_BITS;
	PINMODE_OD1 = PIO1_OPENDRAIN_BITS;
	PINMODE_OD2 = PIO2_OPENDRAIN_BITS;
	PINMODE_OD3 = PIO3_OPENDRAIN_BITS;
	PINMODE_OD4 = PIO4_OPENDRAIN_BITS;

	PINSEL0 = __PINSEL0_val;
	PINSEL1 = __PINSEL1_val;
	PINSEL2 = __PINSEL2_val;
	PINSEL3 = __PINSEL3_val;
	PINSEL4 = __PINSEL4_val;
	PINSEL7 = __PINSEL7_val;
	PINSEL9 = __PINSEL9_val;
}

